package Sample.HouseRentalSystem_Me;

public class ProjectInterface {
    /*主菜单
    ====================房屋出租系统====================
                1   查找房屋
                2   新增房屋
                3   删除房屋
                4   修改房屋信息
                5   房屋列表
                6   退出
     */


    /*查找房屋
    ====================查找房屋====================
    请输入你要查找的id：
    1    Jack    118    海淀区    3000    未出租
    ====================查找房屋====================
     请输入你要查找的id：
    ====================没有该房屋====================
     */


    /*新增房屋
    ====================新增房屋====================
    姓名：
    电话：
    地址：
    月租：
    状态（未出租/已出租）：
    ====================添加完成====================
     */

    /*删除房屋
    ====================删除房屋====================
    请选择待删除房屋编号（-1退出）：
    确认是否删除（Y/N）：请小心选择：
    请输入您的选择（Y/N）：
    ====================删除完成====================
     */


    /*
    ====================修改房屋信息====================
    如果不希望修改某个信息，则直接回车
    请选择待修改房屋编号（-1退出）：
    姓名（原数据）：新数据
    电话（原数据）：新数据
    地址（原数据）：新数据
    月租（原数据）：新数据
    状态（原数据）：新数据
    ====================修改完成====================
     */


    /*房屋列表
    ====================房屋列表====================
    编号    房主    电话    地址    月租    状态（未出租/已出租）

    ====================房屋列表完成====================
     */


    /*退出
    ====================退出====================
    您确定要退出房屋出租系统吗（Y/N）：

    选择错误，请重新输入：
    您推出了程序~~~~~
     */
}
/*
项目设计-程序框架图（分层模式=>当程序比较复杂，需要模式管理），其他模式：Mod 2；Mwc
    1.系统有哪些类（文件）
    2.明确类与类的调用关系

*/
