package Sample.ChangeCard;

public class DescriptionOfProjectDevelopmentProcess {
}
/*项目--零钱通
项目开发流程说明
    项目需求说明
        使用Java开发 零钱通项目，可以完成收益入账、消费、查看明细、退出系统等功能
    项目的界面
        ----------零钱通菜单----------
            1 零钱通明细
            2 收益入账
            3 消费
            4 退出
        请选择（1-4）：
        ----------零钱通明细----------
        收益入账    +100.0    2021-01-21 17:41    余额:100.0
        收益入账    +500.0    2021-01-21 17:42    余额:600.0
        真功夫    -20.0    2021-01-21 17:43    余额:580.0
    项目代码实现
        编写文件    ？？？.java   完成基本功能（过程编程）
        韩顺平老师提示：先使用过程编译，后面改成OOP版本，请学生体会OOP编程带来的好处
    项目代码实现改进
        用户输入4退出时，给出提示“你确定要退出吗？Y/N”，必须输入正确的Y/N，否则循环输入指令，直到输入Y/N
        在收益入账和消费时，判断金额是否合理，并给出相应的提示
        将面向过程的代码改成面向对象的方法
 */